{
"heading":"SimpleMenu class",
"intro":"This class provides methods for making menus.",
"example":"$mm = new SimpleMenu(APP_PATH);\n$style = $mm->CSS();\n$main_menu = $mm->menu(array(\n  $mm->item('Home',''),\n  $mm->item('Products','products'),\n  $mm->item('Contact','contact'),\n  $mm->item('About','about')));",
"description":"This class has only static methods, you can make an instance or use it statically. It has three methods in addition to the constructor.</p><p>The constructor can be used to set the application path, but you can also do this statically.</p><p>The <code>menu()</code> method requires a list of menu items, which you can create using the <code>item()</code> method. The <code>menu()</code> method also have a second argument which is optional: a class to add for indicating a sub menu. By default this should be the string 'submenu'.</p><p>There is also a method named <code>CSS()</code> which can be used to fetch the CSS generated for the menus. This method takes an optional argument which is an associative array with configuration setting for the menu. You can change font size, padding, width of each menu item and colors. You can change any number of these settings, those you don't provide will use the default value.</p><p>Here is a full list of possible configuration keys and the default values:</p>\n<table style=\"text-align:left\"><tr><th>font-size</th><td>90%</td></tr><tr><th>item-width</th><td>8em</td></tr><tr><th>item-padding</th><td>4px</td></tr><tr><th>sub-indent</th><td>1em</td></tr><tr><th>sub-class</th><td>submenu</td></tr><tr><th>normal</th><td>white/black</td></tr><tr><th>hover</th><td>black/silver</td></tr><tr><th>current</th><td>black/darkgray</td></tr><tr><th>s_normal</th><td>white/darkgreen</td></tr><tr><th>s_hover</th><td>black/limegreen</td></tr><tr><th>s_current</th><td>yellow/green</td></tr></table><p>Colors are provided as pairs, foreground and background, separated by a slash. You can use any color code that is valid for CSS, including hex codes like <code>#aaffaa</code> and <code>rgb(80,80,255)</code>.</p><p><b>Note:</b> This class does not support dropdown menus."
}
